// *******************************************************************
// * 文件名称： WlyBuildingType.cs
// * 作　　者： 王璟星
// * 创建日期： 2018-03-28 23:44:07
// *******************************************************************

namespace Wx.Lib.WlyAutoBiz.WlyDefinition
{
    /// <summary>
    /// 建筑类型
    /// </summary>
    public enum WlyBuildingType
    {
        主城,

        策略府,

        商铺,

        校场,

        民居1,

        民居2,

        民居3,

        民居4,

        商社,

        兵营,

        工坊,

        账房,

        钱庄,

        农田,

        市场,

        船坞,

        试炼塔,

        商贸码头,

        仓库
    }
}