// *******************************************************************
// * 文件名称： WlySwitchType.cs
// * 作　　者： 王璟星
// * 创建日期： 2018-04-19 10:05:39
// *******************************************************************

namespace Wx.Lib.WlyAutoBiz.WlyDefinition
{
    /// <summary>
    /// 任务开关类型
    /// </summary>
    public enum WlySwitchType
    {
        群雄逐鹿,

        活动副本,

        海鲜副本,

        买包子,

        买肉,

        买酒,

        买珍珠,

        买碧玉杯,

        买金香炉,

        买琥珀,

        买蓝宝石,

        买琅邪玉,

        修理密室
    }
}