// *******************************************************************
// * 文件名称： WlyPicType.cs
// * 作　　者： 王璟星
// * 创建日期： 2018-02-09 20:59:52
// *******************************************************************

namespace Wx.Lib.WlyAutoBiz.WlyDefinition
{
    /// <summary>
    /// 图片资源枚举
    /// </summary>
    public enum WlyPicType
    {
        /// <summary>
        /// 进入游戏
        /// </summary>
        进入游戏,

        /// <summary>
        /// 登录成功
        /// </summary>
        登录成功,

        /// <summary>
        /// 日常按钮
        /// </summary>
        日常按钮,

        /// <summary>
        /// 海盗活动目标船
        /// </summary>
        超强炮舰,

        /// <summary>
        /// 封赏
        /// </summary>
        封赏,

        /// <summary>
        /// 每日奖励
        /// </summary>
        每日奖励,

        /// <summary>
        /// VIP奖励
        /// </summary>
        Vip奖励,

        /// <summary>
        /// 选择国家
        /// </summary>
        选择国家,

        资源区,

        日常关闭,

        海盗按钮,

        海鲜副本按钮,

        海鲜副本,

        军团按钮,

        活跃按钮,

        竞技场按钮,

        日常,

        开服礼包,

        离线奖励,

        吴国军团,

        打劫目标,

        活动副本,

        可攻击目标,

        下一个副本,

        新用户注册,

        关闭按钮,

        活动一览按钮,

        酒馆按钮,

        首攻军团,

        收费军团,

        试炼塔目标,

        王位争夺战,

        厉兵秣马,

        游戏助手按钮
    }
}