// *******************************************************************
// * 文件名称： WlySoldierType.cs
// * 作　　者： 王璟星
// * 创建日期： 2018-05-02 15:52:52
// *******************************************************************

namespace Wx.Lib.WlyAutoBiz.WlyDefinition
{
    /// <summary>
    /// 兵种
    /// </summary>
    public enum WlySoldierType
    {
        Unkonwn = 0,

        虎贲刀兵 = 1,

        死神重步 = 2,

        铁鹰剑士 = 3,

        黄金重步 = 4,

        藤甲兵 = 5,

        磐石重甲 = 6,

        止水重步 = 7,

        虎钺爪 = 8,

        黄金枪兵 = 9,

        银月枪兵 = 10,

        烈火方阵 = 11,

        玄武方阵 = 12,

        奇袭长矛兵 = 13,

        大戟士 = 14,

        巨锤钢甲 = 15,

        短戟刺客 = 16,

        云龙骑兵 = 17,

        白马义从 = 18,

        虎豹骑 = 19,

        白银轻骑 = 20,

        遁甲狂牛 = 21,

        战象 = 22,

        陷阵彪骑 = 23,

        黄金重骑 = 24,

        疾风镖手 = 25,

        重弩炮车 = 26,

        刺客 = 27,

        黄金连弩 = 28,

        烈火长弓 = 29,

        鹰眼 = 30,

        冲车 = 31,

        天雷轰 = 32,

        炎火策士 = 33,

        驭风行者 = 34,

        控土术士 = 35,

        紫电使 = 36,

        洪水策士 = 37,

        舞姬 = 38,

        旗鼓手 = 39,

        巫术师 = 40,

        引雷术士 = 41,

        烈焰策士,

        花魁,

        沧浪策士,

        擂鼓队,

        巫毒士,

        回旋镖手 = 49,

        红炎策弓,

        皇廷重弩,

        影卫,

        龙头炮,

        连弩车,

        天火雷轰,

        长空猎弓,

        雷霆剑士 = 57,

        磐垒护卫,

        虎骁力士,

        圆武方阵 = 65,

        圣月枪兵,

        神风骑 = 73,

        白龙圣骑,

        南蛮战象,

        流火木牛
    }
}