// *******************************************************************
// * 文件名称： WlyTaskType.cs
// * 作　　者： 王璟星
// * 创建日期： 2018-02-23 17:34:53
// *******************************************************************

namespace Wx.Lib.WlyAutoBiz.WlyDefinition
{
    /// <summary>
    /// 任务类型枚举
    /// </summary>
    public enum WlyTaskType
    {
        擂台赛报名,

        田矿占领,

        海盗活动,

        巡查,

        领取奖励,

        古城探险,

        购买军令,

        打猎,

        擂台助威,

        城池争夺战,

        群雄逐鹿,

        海鲜副本,

        购物,

        卖粮,

        寻访,

        强征,

        古代战场,

        清理仓库,

        开启格子,

        客串海盗,

        活动副本,

        修理船只,

        装备重铸
    }
}