// *******************************************************************
// * 文件名称： WlyViewType.cs
// * 作　　者： 王璟星
// * 创建日期： 2018-03-10 17:31:38
// *******************************************************************

namespace Wx.Lib.WlyAutoBiz.WlyDefinition
{
    /// <summary>
    /// 卧龙吟界面类型枚举
    /// </summary>
    public enum WlyViewType
    {
        Unknow,

        场景_主界面,

        场景_主城,

        场景_日常,

        略_加入失败,

        场景_军团战,

        场景_战斗,

        日常_城池争夺战,

        场景_武魁高塔,

        场景_武魁高塔战斗,

        日常_擂台赛,

        日常_海盗,

        功能_巡查,

        日常_古城探秘,

        功能_打猎,

        略_跳过,

        略_点击继续,

        右侧任务栏,

        民居1,

        场景_资源区,

        功能_市场,

        场景_副本,

        聊天,

        活动界面,

        导航_日常按钮栏,

        场景_海鲜副本,

        日常_群雄逐鹿,

        建筑_商铺,

        功能_商城,

        功能_卖粮,

        场景_府邸,

        功能_寻访,

        主城建筑,

        功能_征收,

        日常_古代战场,

        功能_属臣,

        略_防沉迷验证,

        功能_军团,

        功能_仓库,

        建筑_策略府,

        建筑_校场,

        功能_升级科技,

        场景_港口,

        功能_训练,

        民居2,

        民居3,

        民居4,

        功能_装备,

        建筑_船坞,

        功能_出航贸易,

        建筑_商贸码头,

        场景_活动副本,

        功能_船坞,

        功能_主公信息,

        功能_主公属性,

        招募_裴元绍,

        场景_世界地图,

        场景_虎牢关战役,

        功能_商旅,

        建筑_商社,

        功能_古代战场,

        功能_军团战,

        功能_将器,

        功能_阵型,

        功能_强化装备,

        建筑_兵营,

        功能_征兵,

        功能_武将,

        右侧提示,

        功能_招募,

        功能_普通砸罐,

        功能_酒馆,

        略_建筑等待,

        功能_主线任务,

        功能_每日任务,

        场景_密室,

        功能_军团礼包,

        功能_委派,

        场景_游历,

        建筑_工坊,

        功能_生产,

        略_确定,

        略_等级礼包,

        功能_转盘,

        略_充值,

        民居,

        略_花费提示,

        建筑_账房,

        建筑_钱庄,

        建筑_农田,

        功能_军团信息,

        功能_军团科技,

        建筑_试炼塔,

        功能_活跃,

        场景_竞技场,

        功能_官职,

        功能_红包,

        功能_试炼塔,

        场景_国政,

        功能_王位争夺战,

        功能_厉兵秣马,

        功能_团战报名,

        建筑_仓库,

        功能_游戏助手
    }
}